neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBHub.cpp
/*
 * Copyright (c) 1998-2000 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * The contents of this file constitute Original Code as defined in and
 * are subject to the Apple Public Source License Version 1.1 (the
 * "License").  You may not use this file except in compliance with the
 * License.  Please obtain a copy of the License at
 * http://www.apple.com/publicsource and read it before using this file.
 * 
 * This Original Code and all software distributed under the License are
 * distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
 * License for the specific language governing rights and limitations
 * under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@
 */
/*
 * Copyright (c) 1998 Apple Computer, Inc.  All rights reserved.
 *
 * HISTORY
 *
 */

#include <libkern/OSByteOrder.h>

#include "IOUSBHub.h"
#include <IOKit/usb/IOUSBInterface.h>
#include <IOKit/usb/IOUSBPipe.h>

#define super IOService
#define self this
#define DEBUGGING_LEVEL 0
#define DEBUGLOG kprintf

UInt32 GetErrataBits(IOUSBDeviceDescriptor *desc);

/* private API */
static void callStartHandler(void *hub)
{
    ((IOUSBHub *) hub)->StartHandler();
}

OSDefineMetaClassAndStructors(IOUSBHub, IOService)

bool IOUSBHub::init( OSDictionary * propTable )
{
    if( !super::init(propTable))
        return (false);

    _numCaptive = 0;

    return(true);
}

bool IOUSBHub::start(IOService * provider)
{
    IOReturn			err = 0;
    IOUSBDevice::FindInterfaceRequest	req;
    IOThread 			ioThread;
    
    if( !super::start(provider))
        return (false);

    // remember my device
    _device		= (IOUSBDevice *) provider;
    _address		= _device->address();
    _bus		= _device->bus();

    if (!_device->open(this)) return false;
    
    do {
        IOLog("%s: USB Generic Hub @ %d\n", getName(), _address);

        // Find the first config/interface
        if (_device->deviceDescriptor()->numConf < 1)
        {
            IOLog("%s: no hub configurations\n", getName());
            break;
        }

        req.theClass = kUSBHubClass;
	req.subClass = req.protocol = 0;
        req.maxPower = 0;
        if ((_hubInterface = _device->findNextInterface(NULL, &req)) == 0)
        {
            IOLog("%s: no interface found\n", getName());
            break;
        }
        _busPowered = req.busPowered == 2;	//FIXME
        _selfPowered = req.selfPowered == 2;	//FIXME

        if( !(_busPowered || _selfPowered) )
        {
            IOLog("%s: illegal device config - no power\n", getName());
            break;
        }

        // set my configuration

        if ((err = _device->SetConfiguration(_hubInterface->getConfigValue())))
            break;

        // Get the hub descriptor
        if ((err = GetHubDescriptor(&_hubDescriptor)))
            break;

	// Setup for reading status pipe
        _buffer = IOBufferMemoryDescriptor::withCapacity(8, kIODirectionIn);

        if (!_hubInterface->open(this))
            break;

        IOUSBFindEndpointRequest request;
        request.type = kUSBInterrupt;
        request.direction = kUSBIn;
        _interruptPipe = _hubInterface->findNextPipe(NULL, &request);

        if(!_interruptPipe)
            return false;

        // prepare the ports
	UnpackPortFlags();
        CountCaptivePorts();
#if (DEBUGGING_LEVEL > 0)
        PrintHubDescriptor(&_hubDescriptor);
#endif
        if (!CheckPortPowerRequirements())	continue;
        if (!AllocatePortMemory())		continue;
        if (!StartPorts())			continue;
        ioThread = IOCreateThread(callStartHandler, this);
        if (ioThread == NULL) 			continue;
                
        return(true);

    } while (false);

    IOLog("%s: aborting startup.  err = %d\n", getName(), err);

    _device->close(this);
    stop(provider);
    
    return(false);
}

void IOUSBHub::stop(IOService * provider)
{
    // stop/close all ports
    // deallocate ports
    StopPorts();

    if (_buffer) {
        _buffer->release();
	_buffer = 0;
    }
    if(_hubInterface) {
        _hubInterface->close(this);
        _hubInterface->release();
        _hubInterface = 0;
    }
    super::stop(provider);
}

/**********************************************************************
 **
 ** HUB FUNCTIONS
 **
 **********************************************************************/
void IOUSBHub::UnpackPortFlags(void)
{
    // ERIC FIXME?- I don't think the first +1 should be there.
    int numFlags = ((_hubDescriptor.numPorts + 1) / 8) + 1;
    int i;

    for(i = 0; i < numFlags; i++)
    {
        _hubDescriptor.pwrCtlPortFlags[i] =
        			_hubDescriptor.removablePortFlags[numFlags+i];
        _hubDescriptor.removablePortFlags[numFlags+i] = 0;
    }
}

void IOUSBHub::CountCaptivePorts(void)
{
    int 		portMask = 2;
    int 		portByte = 0;
    int			currentPort;


    for (currentPort = 1; currentPort <= _hubDescriptor.numPorts; currentPort++)
    {
        /* determine if the port is a captive port */
        if ((_hubDescriptor.removablePortFlags[portByte] & portMask) != 0)
            _numCaptive++;		// save this for power calculations

        portMask <<= 1;
        if(portMask > 0x80)
        {
            portMask = 1;
            portByte++;
        }
    }
}


/*
 ExtPower   Good      off

Bus  Self

0     0     Illegal config
1     0     Always 100mA per port
0     1     500mA     0 (dead)
1     1     500      100
*/
bool IOUSBHub::CheckPortPowerRequirements(void)
{
    IOReturn	err = kIOReturnSuccess;
    /* Note hub current in units of 1mA, everything else in units of 2mA */
    UInt32	hubPower = _hubDescriptor.hubCurrent/2;
    UInt32	busPower = _device->busPowerAvailable();
    UInt32	powerAvailForPorts, powerNeededForPorts;
    bool	startExternal;

    do
    {
        if (hubPower > busPower)
        {
            IOLog("%s: hub needs more power than available", getName());
            err = kIOReturnNoPower;
        }

        powerAvailForPorts = busPower - hubPower;
        /* we minimally need make available 100mA per non-captive port */
        powerNeededForPorts =
            (_hubDescriptor.numPorts - _numCaptive) * kUSB100mA;
        _busPowerGood = powerAvailForPorts >= powerNeededForPorts;
        if(_numCaptive > 0)
        {
            if(_busPowerGood)
                _powerForCaptive =
                    (powerAvailForPorts - powerNeededForPorts) / _numCaptive;
            else
                _powerForCaptive = powerAvailForPorts / _numCaptive;
        }

