neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBHub.cpp
        if( (_errataBits & kErrataCaptiveOK) != 0)
            _powerForCaptive = kUSB100mAAvailable;

#if (DEBUGGING_LEVEL > 0)
        DEBUGLOG("%s: power:\n", getName());
        DEBUGLOG("\tbus power available = %ldmA\n", busPower * 2);
        DEBUGLOG("\thub power needed = %ldmA\n", hubPower * 2);
        DEBUGLOG("\tport power available = %ldmA\n", powerAvailForPorts * 2);
        DEBUGLOG("\tport power needed = %ldmA\n", powerNeededForPorts * 2);
        DEBUGLOG("\tpower for captives = %ldmA\n", _powerForCaptive * 2);
        DEBUGLOG("\tbus power is %s\n", _busPowerGood?"good" : "insufficient");
#endif
        
        _selfPowerGood = false;
        
        if(_selfPowered)
        {
            USBStatus	status = 0;

            if ((err = _device->GetDeviceStatus(&status))) 	break;
            status = USBToHostWord(status);
            _selfPowerGood = ((status & 1) != 0);	// FIXME 1?
        }

        if(_selfPowered && _busPowered)
        {
            /* Dual power hub */
            DEBUGLOG("%s: Hub attached - Self/Bus powered, ", getName());
            if(_selfPowerGood)
                DEBUGLOG("power supply good\n");
            else
                DEBUGLOG("no external power\n");
        }
        else
        {
            /* Single power hub */
            if(_selfPowered)
            {
                DEBUGLOG("%s: Hub attached - Self powered, ", getName());
                if(_selfPowerGood)
                    DEBUGLOG("power supply good\n");
                else
                    DEBUGLOG("no external power\n");
            }
            else
            {
                DEBUGLOG("%s: Hub attached - Bus powered\n", getName());
            }

        }
        startExternal = (_busPowerGood || _selfPowerGood);
        if( !startExternal )
        {	/* not plugged in or bus powered on a bus powered hub */
            err = kIOReturnNoPower;
            DEBUGLOG("%s: insufficient power to turn on ports\n", getName());
            if(!_busPowered)
            {
                /* may be able to turn on compound devices */
                break;	/* Now what ?? */
            }
        }
    } while (false);

    return(err == kIOReturnSuccess);
}


bool IOUSBHub::AllocatePortMemory(void)
{
    IOUSBHubPort 	*port;
    UInt32		power;
    int 		portMask = 2;
    int 		portByte = 0;
    int			currentPort;


    _ports = (IOUSBHubPort **)
    		IOMalloc(sizeof(IOUSBHubPort *) * _hubDescriptor.numPorts);
    if (!_ports)
        return(false);

    for (currentPort = 1; currentPort <= _hubDescriptor.numPorts; currentPort++)
    {
        /* determine if the port is a captive port */
        if ((_hubDescriptor.removablePortFlags[portByte] & portMask) != 0)
        {
            power = _powerForCaptive;
        }
        else
        {
            power = _selfPowerGood ? kUSB500mAAvailable : kUSB100mAAvailable;
        }

        port = new IOUSBHubPort;
        port->init(self, currentPort, power);
        _ports[currentPort-1] = port;

        portMask <<= 1;
        if(portMask > 0x80)
        {
            portMask = 1;
            portByte++;
        }
    }
    
    return(true);
}


bool IOUSBHub::StartPorts(void)
{
    IOReturn		err = kIOReturnSuccess;
    IOUSBHubPort 	*port;
    int			currentPort;
    //IOThread 	     	ioThread;


#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("%s: starting ports (%d)\n", getName(), _hubDescriptor.numPorts);
#endif

    for (currentPort = 1; currentPort <= _hubDescriptor.numPorts; currentPort++)
    {
        port = _ports[currentPort-1];
	if (port)
            err = port->start();

        // Temporarily fork off a thread for each port.  Each port could
        // potentially call addDevice which will generate hub events.
        //ioThread = IOCreateThread(callStart, port);
        //if (ioThread == NULL)
        //{
        //    err = kIOReturnNoMemory;
        //    break;
        //}
    }

    // Ignore any error for now.  Maybe the hub would want to know
    // if all ports failed, but if at least one succeeds, then we
    // should continue.
    return(true);
}

bool IOUSBHub::StopPorts(void)
{
    IOUSBHubPort 	*port;
    int			currentPort;


#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("%s: stopping ports (%d)\n", getName(), _hubDescriptor.numPorts);
#endif

    if( _ports) for (currentPort = 1; currentPort <= _hubDescriptor.numPorts; currentPort++)
    {
        port = _ports[currentPort-1];
	if (port) {
            port->stop();
            delete port;
            _ports[currentPort-1] = 0;
	}
    }

    IOFree(_ports, sizeof(IOUSBHubPort *) * _hubDescriptor.numPorts);
    _ports = 0;
    return(true);
}

const UInt8 * IOUSBHub::getStatusChanged(void)
{
    IOReturn		err = kIOReturnSuccess;
    const UInt8 *	status = NULL;

    _buffer->setLength(8);

    do
    {
        if ((err = _interruptPipe->read(_buffer)))
        {
            DEBUGLOG("%s: error 0x%x reading interrupt pipe.\n", getName(), err);
            break;
        }

        if (err == kIOReturnNotResponding)
        {
            // This probably means the device was unplugged.
            break;
        }
        else if (err != kIOReturnSuccess)
        {
            // We should handle other errors more intelligently, but
            // for now just return and assume the error is recoverable.
            //kprintf("%s: error %d reading interrupt pipe\n", getName(), err);
            break;
        }
        status = (const UInt8 *)_buffer->getBytesNoCopy();
    } while (false);
    return status;
}

bool IOUSBHub::StartHandler(void)
{
    IOReturn	err = kIOReturnSuccess;
    const UInt8	*statusChangedBitmap;
    int 	portMask;
    int 	portByte;
    int 	portIndex;
    IOUSBHubPort *port;

    do
    {
        portMask = 2;
        portByte = 0;
        statusChangedBitmap = getStatusChanged();
        if (statusChangedBitmap == 0)
        {
            DEBUGLOG("%s: no data returned from int pipe\n", getName());
            break;
        }

#if (DEBUGGING_LEVEL > 0)
        DEBUGLOG("read returned 0x%x (%d)\n", statusChangedBitmap[portByte],
                 _buffer->getLength());
#endif

        for (portIndex = 1; portIndex <=_hubDescriptor.numPorts; portIndex++)
        {
            if ((statusChangedBitmap[portByte] & portMask) != 0)
            {
                port = _ports[portIndex-1];
                port->statusChanged();
            }

