neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBHub.cpp
            portMask <<= 1;
            if (portMask > 0x80)
            {
                portMask = 1;
                portByte++;
            }
        }

        /* hub status changed */
        if ((statusChangedBitmap[0] & 1) != 0)
        {	
            statusChanged();
        }

    } while (true);

    DEBUGLOG("%s: error %d.  Exiting Hub Handler\n", getName(), err);

    _device->close(this);
    
    return(false);
}


bool IOUSBHub::statusChanged(void)
{
    IOReturn	err = kIOReturnSuccess;

    do
    {
        if ((err = GetHubStatus(&_hubStatus)))
        {
            fatalError(err, "get status (first in hub status change)");
            break;            
        }
        _hubStatus.statusFlags = USBToHostWord(_hubStatus.statusFlags);
        _hubStatus.changeFlags = USBToHostWord(_hubStatus.changeFlags);

#if (DEBUGGING_LEVEL > 0)
        DEBUGLOG("%s: hub status = %x/%x\n", getName(),
                 _hubStatus.statusFlags, _hubStatus.changeFlags);
#endif

        if (_hubStatus.changeFlags & kHubLocalPowerStatusChange)
        {
#if (DEBUGGING_LEVEL > 0)
            DEBUGLOG("%s: Local Power Status Change detected\n", getName());
#endif
            if ((err = ClearHubFeature(kHubLocalPowerStatusChange)))
            {
                fatalError(err, "clear hub power status feature");
                break;
            }
            if ((err = GetHubStatus(&_hubStatus)))
            {
                fatalError(err, "get status (second in hub status change)");
                break;
            }
            _hubStatus.statusFlags = USBToHostWord(_hubStatus.statusFlags);
            _hubStatus.changeFlags = USBToHostWord(_hubStatus.changeFlags);
        }

        if (_hubStatus.changeFlags & kHubOverCurrentIndicatorChange)
        {
#if (DEBUGGING_LEVEL > 0)
            DEBUGLOG("%s: OverCurrent Indicator Change detected\n", getName());
#endif
            if ((err =
                 ClearHubFeature(kHubOverCurrentIndicatorChange)))
            {
                fatalError(err, "clear hub over current feature");
                break;
            }
            if ((err = GetHubStatus(&_hubStatus)))
            {
                fatalError(err, "get status (second in hub status change)");
                break;
            }
            _hubStatus.statusFlags = USBToHostWord(_hubStatus.statusFlags);
            _hubStatus.changeFlags = USBToHostWord(_hubStatus.changeFlags);
        }

        //DEBUGLOG("%s: calling delay reentering poll loop\n", getName());
        //USBDelay(10);  //FIXME

    } while(false);

    return(err == kIOReturnSuccess);
}

static ErrataListEntry	errataList[] = {

/* For the Cherry 4 port KB, From Cherry:
We use the bcd_releasenumber-highbyte for hardware- and the lowbyte for
firmwarestatus. We have 2 different for the hardware 03(eprom) and
06(masked microcontroller). Firmwarestatus is 05 today.
So high byte can be 03 or 06 ----  low byte can be 01, 02, 03, 04, 05

Currently we are working on a new mask with the new descriptors. The
firmwarestatus will be higher than 05.
*/
      {0x046a, 0x003, 0x0301, 0x0305, kErrataCaptiveOK}, // Cherry 4 port KB
      {0x046a, 0x003, 0x0601, 0x0605, kErrataCaptiveOK}  // Cherry 4 port KB
};

#define errataListLength (sizeof(errataList)/sizeof(ErrataListEntry))

UInt32 GetErrataBits(IOUSBDeviceDescriptor *desc)
{
      UInt16		vendID, deviceID, revisionID;
      ErrataListEntry	*entryPtr;
      UInt32		i, errata = 0;

      // get this chips vendID, deviceID, revisionID
      vendID = USBToHostWord(desc->vendor);
      deviceID = USBToHostWord(desc->product);
      revisionID = USBToHostWord(desc->devRel);

      for(i=0, entryPtr = errataList; i < errataListLength; i++, entryPtr++)
      {
          if (vendID == entryPtr->vendID
              && deviceID == entryPtr->deviceID
              && revisionID >= entryPtr->revisionLo
              && revisionID <= entryPtr->revisionHi)
          {
              errata |= entryPtr->errata;  // we match, add this errata to our list
          }
      }
      return(errata);
}

void IOUSBHub::fatalError(IOReturn err, char *str)
{
    DEBUGLOG("IOUSBHub: Error %d: %s\n", err, str);
}

IOReturn IOUSBHub::GetHubDescriptor(IOUSBHubDescriptor *desc)
{
    IOReturn	err = kIOReturnSuccess;
    IOUSBDevRequest	request;

#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("*********** GET HUB DESCRIPTOR ***********\n");
#endif

    if (!desc) return (kIOReturnBadArgument);

    request.rqDirection = kUSBIn;
    request.rqType = kUSBClass;
    request.rqRecipient = kUSBDevice;
    request.bRequest = kUSBRqGetDescriptor;
    OSWriteLittleInt16(&request.wValue, 0, kUSBHubDescriptorType);
    OSWriteLittleInt16(&request.wIndex, 0, 0);
    OSWriteLittleInt16(&request.wLength, 0, sizeof(IOUSBHubDescriptor));
    request.pData = desc;

    err = _device->deviceRequest(&request);

    if (err)
    {
        /*
         * Is this a bogus hub?  Some hubs require 0 for the descriptor type
         * to get their device descriptor.  This is a bug, but it's actually
         * spec'd out in the USB 1.1 docs.
         */
        OSWriteLittleInt16(&request.wValue, 0, 0);
        OSWriteLittleInt16(&request.wLength, 0, sizeof(IOUSBHubDescriptor));
        err = _device->deviceRequest(&request);
    }

    if (err)
        IOLog("%s: error getting hub descriptor. err=%d\n", getName(), err);

    return(err);
}

IOReturn IOUSBHub::GetHubStatus(IOUSBHubStatus *status)
{
    IOReturn		err = kIOReturnSuccess;
    IOUSBDevRequest	request;

#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("************* GET HUB STATUS *************\n");
#endif

    request.rqDirection = kUSBIn;
    request.rqType = kUSBClass;
    request.rqRecipient = kUSBDevice;
    request.bRequest = kUSBRqGetStatus;
    OSWriteLittleInt16(&request.wValue, 0, 0);
    OSWriteLittleInt16(&request.wIndex, 0, 0);
    OSWriteLittleInt16(&request.wLength, 0, sizeof(IOUSBHubStatus));
    request.pData = status;

    err = _device->deviceRequest(&request);

    if (err)
        IOLog("%s: error getting hub status. err=%d\n", getName(), err);

    return(err);
}

IOReturn IOUSBHub::GetPortState(UInt8 *state, UInt16 port)
{
    IOReturn		err = kIOReturnSuccess;
    IOUSBDevRequest	request;

#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("************* GET PORT STATE *************\n");
#endif

    request.rqDirection = kUSBIn;
    request.rqType = kUSBClass;
    request.rqRecipient = kUSBOther;
    request.bRequest = kUSBRqGetState;
    OSWriteLittleInt16(&request.wValue, 0, 0);
    OSWriteLittleInt16(&request.wIndex, 0, port);
    OSWriteLittleInt16(&request.wLength, 0, sizeof(*state));
    request.pData = state;

    err = _device->deviceRequest(&request);

    if (err)
        IOLog("%s: error getting hub state. err=%d\n", getName(), err);

    return(err);
}

IOReturn IOUSBHub::ClearHubFeature(UInt16 feature)
{
    IOReturn		err = kIOReturnSuccess;
    IOUSBDevRequest	request;

#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("********** CLEAR HUB FEATURE %d **********\n", feature);
#endif

    request.rqDirection = kUSBOut;
    request.rqType = kUSBClass;
    request.rqRecipient = kUSBDevice;
    request.bRequest = kUSBRqClearFeature;
    OSWriteLittleInt16(&request.wValue, 0, feature);
    OSWriteLittleInt16(&request.wIndex, 0, 0);
    OSWriteLittleInt16(&request.wLength, 0, 0);
    OSWriteLittleInt16(&request.pData, 0, 0);

    err = _device->deviceRequest(&request);

    if (err)
        IOLog("%s: error clearing hub feature. err=%d\n", getName(), err);

    return(err);
}

