neozeed/Darwin_1.0/xnu-1-1/iokit/Families/IOUSBBus/IOUSBHub.cpp
IOReturn IOUSBHub::GetPortStatus(IOUSBHubPortStatus *status, UInt16 port)
{
    IOReturn	err = kIOReturnSuccess;
    IOUSBDevRequest	request;

#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("*********** GET PORT %d STATUS ************\n", port);
#endif

    request.rqDirection = kUSBIn;
    request.rqType = kUSBClass;
    request.rqRecipient = kUSBOther;
    request.bRequest = kUSBRqGetStatus;
    OSWriteLittleInt16(&request.wValue, 0, 0);
    OSWriteLittleInt16(&request.wIndex, 0, port);
    OSWriteLittleInt16(&request.wLength, 0, sizeof(IOUSBHubPortStatus));
    request.pData = status;

    err = _device->deviceRequest(&request);

    if (err)
        IOLog("%s: error getting port status. err=%d\n", getName(), err);

    // Get things the right way round.
    status->statusFlags = OSReadLittleInt16(&status->statusFlags, 0);
    status->changeFlags = OSReadLittleInt16(&status->changeFlags, 0);

    return(err);
}

IOReturn IOUSBHub::SetPortFeature(UInt16 feature, UInt16 port)
{
    IOReturn		err = kIOReturnSuccess;
    IOUSBDevRequest	request;

#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("********* SET PORT %d FEATURE %d **********\n", port, feature);
#endif

    request.rqDirection = kUSBOut;
    request.rqType = kUSBClass;
    request.rqRecipient = kUSBOther;
    request.bRequest = kUSBRqSetFeature;
    OSWriteLittleInt16(&request.wValue, 0, feature);
    OSWriteLittleInt16(&request.wIndex, 0, port);
    OSWriteLittleInt16(&request.wLength, 0, 0);
    request.pData = 0;

    err = _device->deviceRequest(&request);

    if (err)
        IOLog("%s: error setting port feature. err=%d\n", getName(), err);

    return(err);
}

IOReturn IOUSBHub::ClearPortFeature(UInt16 feature, UInt16 port)
{
    IOReturn		err = kIOReturnSuccess;
    IOUSBDevRequest	request;

#if (DEBUGGING_LEVEL > 0)
    DEBUGLOG("******** CLEAR PORT %d FEATURE %d *********\n", port, feature);
#endif

    request.rqDirection = kUSBOut;
    request.rqType = kUSBClass;
    request.rqRecipient = kUSBOther;
    request.bRequest = kUSBRqClearFeature;
    OSWriteLittleInt16(&request.wValue, 0, feature);
    OSWriteLittleInt16(&request.wIndex, 0, port);
    OSWriteLittleInt16(&request.wLength, 0, 0);
    request.pData = 0;

    err = _device->deviceRequest(&request);

    if (err)
        IOLog("%s: error clearing port feature. err=%d\n", getName(), err);

    return(err);
}

void IOUSBHub::PrintHubDescriptor(IOUSBHubDescriptor *desc)
{
    int i = 0;
    char *characteristics[] =
        { "ppsw", "nosw", "comp", "ppoc", "nooc", 0 };


    if (desc->length == 0) return;

    DEBUGLOG("hub descriptor: (%d bytes)\n", desc->length);
    DEBUGLOG("\thubType = %d\n", desc->hubType);
    DEBUGLOG("\tnumPorts = %d\n", desc->numPorts);
    DEBUGLOG("\tcharacteristics = %x ( ",
                                USBToHostWord(desc->characteristics));
    do
    {
        if (USBToHostWord(desc->characteristics) & (1 << i))
            DEBUGLOG("%s ", characteristics[i]);
    } while (characteristics[++i]);
    DEBUGLOG(")\n");
    DEBUGLOG("\tpowerOnToGood = %d ms\n", desc->powerOnToGood * 2);
    DEBUGLOG("\thubCurrent = %d\n", desc->hubCurrent);
    DEBUGLOG("\tremovablePortFlags = %x %x\n", &desc->removablePortFlags[1], &desc->removablePortFlags[0]);
    DEBUGLOG("\tpwrCtlPortFlags    = %x %x\n", &desc->pwrCtlPortFlags[1], &desc->removablePortFlags[0]);
}
